app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def advance_edit
    @dish = Dish.find_by(id: params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("title", "ready_in_minutes", "image", "summary", "sourceurl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_dish
      @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]